###################################################################

# Created by write_sdc on Wed Mar 20 00:40:31 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 0
create_clock [get_ports Clock]  -period 1.03  -waveform {0 0.515}
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[0][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[0][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[1][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[1][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[2][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[2][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a0[3][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a0[3][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[0][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[0][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[1][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[1][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[2][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[2][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a1[3][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a1[3][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[0][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[0][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[1][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[1][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[2][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[2][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {a2[3][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {a2[3][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[0][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[0][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[1][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[1][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[2][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[2][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b0[3][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b0[3][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[0][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[0][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[1][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[1][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[2][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[2][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b1[3][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b1[3][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[0][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[0][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[1][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[1][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[2][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[2][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][23]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][23]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][22]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][22]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][21]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][21]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][20]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][20]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][19]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][19]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][18]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][18]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][17]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][17]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][16]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][16]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][15]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][15]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][14]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][14]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][13]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][13]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][12]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][12]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][11]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][11]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][10]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][10]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][9]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][9]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][8]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][8]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][7]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][7]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][6]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][6]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][5]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][5]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][4]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][4]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][3]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][3]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][2]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][2]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {b2[3][0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {b2[3][0]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {model_in[1]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {model_in[1]}]
set_input_delay -clock Clock  -max 0.6695  [get_ports {model_in[0]}]
set_input_delay -clock Clock  -min 0.1545  [get_ports {model_in[0]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[31]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[31]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[30]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[30]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[29]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[29]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[28]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[28]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[27]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[27]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[26]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[26]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[25]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[25]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[24]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[24]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[23]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[23]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[22]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[22]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[21]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[21]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[20]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[20]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[19]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[19]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[18]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[18]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[17]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[17]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[16]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[16]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[15]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[15]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[14]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[14]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[13]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[13]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[12]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[12]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[11]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[11]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[10]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[10]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[9]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[9]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[8]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[8]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[7]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[7]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[6]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[6]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[5]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[5]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[4]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[4]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[3]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[3]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[2]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[2]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[1]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[1]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result0[0]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result0[0]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[31]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[31]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[30]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[30]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[29]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[29]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[28]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[28]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[27]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[27]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[26]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[26]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[25]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[25]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[24]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[24]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[23]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[23]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[22]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[22]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[21]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[21]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[20]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[20]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[19]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[19]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[18]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[18]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[17]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[17]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[16]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[16]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[15]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[15]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[14]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[14]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[13]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[13]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[12]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[12]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[11]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[11]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[10]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[10]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[9]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[9]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[8]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[8]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[7]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[7]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[6]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[6]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[5]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[5]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[4]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[4]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[3]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[3]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[2]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[2]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[1]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[1]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result1[0]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result1[0]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[31]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[31]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[30]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[30]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[29]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[29]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[28]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[28]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[27]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[27]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[26]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[26]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[25]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[25]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[24]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[24]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[23]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[23]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[22]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[22]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[21]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[21]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[20]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[20]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[19]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[19]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[18]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[18]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[17]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[17]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[16]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[16]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[15]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[15]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[14]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[14]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[13]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[13]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[12]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[12]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[11]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[11]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[10]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[10]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[9]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[9]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[8]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[8]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[7]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[7]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[6]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[6]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[5]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[5]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[4]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[4]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[3]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[3]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[2]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[2]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[1]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[1]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {result2[0]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {result2[0]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {model0[1]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {model0[1]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {model0[0]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {model0[0]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {model1[1]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {model1[1]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {model1[0]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {model1[0]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {model2[1]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {model2[1]}]
set_output_delay -clock Clock  -max 0.6695  [get_ports {model2[0]}]
set_output_delay -clock Clock  -min 0.1545  [get_ports {model2[0]}]
set_clock_uncertainty 0.206  [get_ports Clock]
